-- Generated from cached 60.tools Forever quest pages and translation cache.
-- Re-run tools/sixtytools_forever_quests.py --stage render after reviewing translations.
local _, addonTable = ...
local alliance = {
}
for questID, translation in pairs(alliance) do
    if addonTable.quest_alliance[questID] == nil then
        addonTable.quest_alliance[questID] = translation
    end
end
local both = {
[2358] = { en="Horns of Nez'ra",
    [=[Роги Незри]=],
    [=[Багато років тому Роги Нез'ри були викрадені з маєтку Рейвенгольдт. Я шукав їх по всіх континентах і океанах, але виявив, що ці незначні істоти весь цей час володіли ними.

Вбивайте кожного орка Чорної Скелі, якого перетнете, доки не знайдете Роги Нез'ри. Якщо знайдете роги, знайдіть мене в Озерному Ширі.

Зробіть це для мене, і ваше ім'я стане відомим Рейвенгольдту, {ім'я}.]=],
    [=[Поверніть Роги Нез'ри до Тіні Арантіра в Озерному Ширі.]=],
    [=[У тебе є роги демонічного принца?]=],
    [=[Заперечувати артефакт Рейвенгольдту означало б заперечувати власне існування. Молодець, {клас}. Ти ще можеш ходити серед убивць Рейвенгольдта.

Будучи молодим розбійником, який мандрував по Темних Берегах, я відкрив чай, який відновлює енергію в бою. Він добре служив мені протягом багатьох років, і тепер я передаю тобі смак чаю з будяка. Пий його, коли втомишся, {ім'я}, і знову бийся з енергією!]=],
},
[8289] = { en="Talismans of Merit",
    [=[Талісмани заслуг]=],
    nil,
    nil,
    nil,
    nil,
},
[8296] = { en="Mark of Honor",
    [=[Знак пошани]=],
    nil,
    nil,
    nil,
    nil,
},
[9378] = { en="DND FLAG The Dread Citadel - Naxxramas",
    [=[ПРАПОР DND Цитадель жаху – Наксрамас]=],
    [=[У гущі Чумного Лісу знаходиться вхід до жахливої цитаделі Наксрамаса. Раніше всі спроби увійти туди гальмувалися магічними оберегами, накладеними на рунічний портал. Тобто, досі.

Ми розробили спосіб проникнення за допомогою постійного таємного маскування – старого заклинання Кірін-Тора з деякими моїми власними модифікаціями. З огляду на це, маскування коштує дорого; проте ваша відданість справі Світанку непохитна! Ми відмовимося від усіх зобов'язань щодо витрат.]=],
    [=[Архімаг Анджела Досантос у каплиці Світлої Надії у Східних Чумних Землях безкоштовно надасть вам Арканне Маскування. Ви повинні бути Піднесені Срібним Світанком.]=],
    nil,
    nil,
},
}
for questID, translation in pairs(both) do
    if addonTable.quest_both[questID] == nil then
        addonTable.quest_both[questID] = translation
    end
end
local horde = {
}
for questID, translation in pairs(horde) do
    if addonTable.quest_horde[questID] == nil then
        addonTable.quest_horde[questID] = translation
    end
end
