local _, addonTable = ...
addonTable.race = { -- [id] = { [н/р/д/з/о/м/к] = { 1=male, 2=female, 3=neutral_plural, neutral_singular (optional) } }

-- id: lowercased value of .clientFileString column from https://warcraft.wiki.gg/wiki/RaceId

["human"] = {
    ["н"] = { "чоловік", "жінка", "люди", neutral_singular="людина" },
    ["р"] = { "чоловіка", "жінки", "людей", neutral_singular="людини" },
    ["д"] = { "чоловіку", "жінці", "людям", neutral_singular="людині" },
    ["з"] = { "чоловіка", "жінку", "людей", neutral_singular="людину" },
    ["о"] = { "чоловіком", "жінкою", "людьми", neutral_singular="людиною" },
    ["м"] = { "чоловікові", "жінці", "людях", neutral_singular="людині" },
    ["к"] = { "чоловіче", "жінко", "люди", neutral_singular="людино" },
},

["dwarf"] = {
    ["н"] = { "дворф", "дворфа", "дворфи" },
    ["р"] = { "дворфа", "дворфи", "дворфів" },
    ["д"] = { "дворфу", "дворфі", "дворфам" },
    ["з"] = { "дворфа", "дворфу", "дворфів" },
    ["о"] = { "дворфом", "дворфою", "дворфами" },
    ["м"] = { "дворфові", "дворфі", "дворфах" },
    ["к"] = { "дворфе", "дворфо", "дворфи" },
},

["nightelf"] = {
    ["н"] = { "нічний ельф", "нічна ельфа", "нічні ельфи" },
    ["р"] = { "нічного ельфа", "нічної ельфи", "нічних ельфів" },
    ["д"] = { "нічному ельфу", "нічній ельфі", "нічним ельфам" },
    ["з"] = { "нічного ельфа", "нічну ельфу", "нічних ельфів" },
    ["о"] = { "нічним ельфом", "нічною ельфою", "нічними ельфами" },
    ["м"] = { "нічному ельфові", "нічній ельфі", "нічних ельфах" },
    ["к"] = { "нічний ельфе", "нічна ельфо", "нічні ельфи" },
},

["gnome"] = {
    ["н"] = { "гном", "гномка", "гноми" },
    ["р"] = { "гнома", "гномки", "гномів" },
    ["д"] = { "гному", "гномці", "гномам" },
    ["з"] = { "гнома", "гномку", "гномів" },
    ["о"] = { "гномом", "гномкою", "гномами" },
    ["м"] = { "гномові", "гномці", "гномах" },
    ["к"] = { "гноме", "гномко", "гноми" },
},

["orc"] = {
    ["н"] = { "орк", "орчиня", "орки" },
    ["р"] = { "орка", "орчині", "орків" },
    ["д"] = { "оркові", "орчині", "оркам" },
    ["з"] = { "орка", "орчиню", "орків" },
    ["о"] = { "орком", "орчинею", "орками" },
    ["м"] = { "оркові", "орчині", "орках" },
    ["к"] = { "орку", "орчине", "орки" },
},

["troll"] = {
    ["н"] = { "троль", "тролька", "тролі" },
    ["р"] = { "троля", "трольки", "тролів" },
    ["д"] = { "тролеві", "трольці", "тролям" },
    ["з"] = { "троля", "трольку", "тролів" },
    ["о"] = { "тролем", "тролькою", "тролями" },
    ["м"] = { "тролеві", "трольці", "тролях" },
    ["к"] = { "тролю", "тролько", "тролі" },
},

["scourge"] = {
    ["н"] = { "невмерлий", "невмерла", "невмерлі" },
    ["р"] = { "невмерлого", "невмерлої", "невмерлих" },
    ["д"] = { "невмерлому", "невмерлій", "невмерлим" },
    ["з"] = { "невмерлого", "невмерлу", "невмерлих" },
    ["о"] = { "невмерлим", "невмерлою", "невмерлими" },
    ["м"] = { "невмерлому", "невмерлій", "невмерлих" },
    ["к"] = { "невмерлий", "невмерла", "невмерлі" },
},

["tauren"] = {
    ["н"] = { "таурен", "тауренка", "таурени" },
    ["р"] = { "таурена", "тауренки", "тауренів" },
    ["д"] = { "тауренові", "тауренці", "тауренам" },
    ["з"] = { "таурена", "тауренку", "тауренів" },
    ["о"] = { "тауреном", "тауренкою", "тауренами" },
    ["м"] = { "тауренові", "тауренці", "тауренах" },
    ["к"] = { "таурене", "тауренко", "таурени" },
},

}

-- Adding key for plural chat cases: {раса:мн}, {раса:мр}, etc
for _, race_table in pairs(addonTable.race) do
    local origKeys = {}
    for case, _ in pairs(race_table) do
        table.insert(origKeys, case)
    end

    for _, key in ipairs(origKeys) do
        local newKey = "м" .. key
        local pluralForm = race_table[key][3]
        race_table[newKey] = { pluralForm, pluralForm }
    end
end

addonTable.race["undead"] = addonTable.race["scourge"]  -- Alias for raceName
